Процедура УстановитьОписаниеГлобальногоПоиска() Экспорт
	
	ОписаниеГлобальногоПоискаМассив = Новый Массив;
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'Введите '"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Новый ФорматированнаяСтрока("+", Новый Шрифт(,,Истина)));
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = ' для быстрого создания документов'"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Символы.ПС);
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'Введите номер документа для быстрого поиска по номеру'"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Символы.ПС);
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'Введите '"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Новый ФорматированнаяСтрока("долги", Новый Шрифт(,,Истина)));
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = ' для просмотра пяти самых крупных должников'"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Символы.ПС);
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'Введите '"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Новый ФорматированнаяСтрока("долг", Новый Шрифт(,,Истина)));
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = ' и часть названия контрагента для просмотра его долга'"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Символы.ПС);
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'Введите название контрагента для быстрого поиска и создания нового заказа'"));
	ОписаниеГлобальногоПоискаМассив.Добавить(Символы.ПС);
	ОписаниеГлобальногоПоискаМассив.Добавить(Символы.ПС);
	
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'Введите строку для поиска, ссылку для перехода или поиска, '"));
	ОписаниеГлобальногоПоискаМассив.Добавить(НСтр("ru = 'арифметическое выражение для вычисления'"));
	
	ГлобальныйПоиск.УстановитьОписание(Новый ФорматированнаяСтрока(ОписаниеГлобальногоПоискаМассив));
	
КонецПроцедуры


Процедура ГлобальныйПоискКомандыСоздать(СтрокаПоиска, РезультатПоиска, ДопПараметры) Экспорт
	
	РезультатПоиска.Добавить("+Заказ", НСтр("ru = 'Заказ'"), БиблиотекаКартинок.СоздатьЭлементСписка);
	РезультатПоиска.Добавить("+Приход", НСтр("ru = 'Приходная накладная'"), БиблиотекаКартинок.СоздатьЭлементСписка);
	РезультатПоиска.Добавить("+Расход", НСтр("ru = 'Расходная накладная'"), БиблиотекаКартинок.СоздатьЭлементСписка);
	РезультатПоиска.Добавить("+Оплата", НСтр("ru = 'Оплата'"), БиблиотекаКартинок.СоздатьЭлементСписка);
	
КонецПроцедуры
