//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ 
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//"УчетПоСкладам"
	// Установка параметра Склад динамического списка.
	Если Параметры.Свойство("ОстаткиПоСкладу") Тогда

		СправочникСписок.Параметры.УстановитьЗначениеПараметра("ПоВсемСкладам", Ложь);
		СправочникСписок.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.ОстаткиПоСкладу); 

	Иначе

		Отказ = Истина; 

	КонецЕсли
КонецПроцедуры
