
&НаСервере
Процедура ЗапуститьОбработкуБотов()
	СистемаВзаимодействия.ВыполнитьОбработкуБотов();	
КонецПроцедуры	

&НаСервере
Функция ПолучитьНавигационнуюСсылкуНаОбсуждение()
	
	ИдентификаторПользователяСистемыВзаимодействияОфисМенеджер = БотСервер.ПолучитьИдентификаторБота();
	
	ИдентификаторОбсуждения = БотСервер.ПолучитьИдентификаторОбсуждения(
								СистемаВзаимодействия.ИдентификаторТекущегоПользователя(),
								ИдентификаторПользователяСистемыВзаимодействияОфисМенеджер);
								
	Возврат ПолучитьНавигационнуюСсылку(ИдентификаторОбсуждения);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		СистемаВзаимодействияКлиент.ВыполнитьРегистрацию();
		Возврат;
	КонецЕсли;
	
	ЗапуститьОбработкуБотов();
	
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылкуНаОбсуждение();
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
	
КонецПроцедуры
