
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
#Если МобильныйКлиент Тогда 
	Если ОсновнойСерверДоступен() <> Неопределено Тогда		
		УстановитьИспользуемыйСервер(ИспользуемыйСервер.Автономный);
		ОткрытьФорму("Отчет.ОстаткиТоваровНаСкладахМобильный.Форма.ФормаОтчета");
	Иначе  // Мобильный клиент без возможности автономной работы
		ОткрытьФорму("Отчет.ОстаткиТоваровНаСкладах.Форма.ФормаОтчета");
	КонецЕсли;
#Иначе
	ОткрытьФорму("Отчет.ОстаткиТоваровНаСкладах.Форма.ФормаОтчета");
#КонецЕсли
КонецПроцедуры
