
// Процедура выполняет регистрацию системы взаимодействия
Асинх Процедура ВыполнитьРегистрацию() Экспорт
	
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Система взаимодействие не зарегистрирована. Выполнить регистрацию?'", "ru"),
							  РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("Обработка.УправлениеСистемойВзаимодействия.Форма.Форма");
	КонецЕсли;
	
КонецПроцедуры

// Процедура сообщает о невозможности внешнего доступа в систему взаимодействия
Процедура СообщитьОНевозможностиВнешнегоДоступа() Экспорт

	ПредупреждениеАсинх(НСтр("ru = 'Внешний доступ в систему взаимодействия невозможен! Обратитесь к администратору'", "ru"));	
	
КонецПроцедуры